source/_posts/2015-09-15-easy-opengl-02.html
---
title: "[PREVIEW] 简简单单 OpenGL 02"
date: 2015-09-15
layout: post
categories: 
- 简简单单 
- OpenGL
tags: 
published: false
comments: 
---
<span style="background: red;">PREVIEW</span>
<div id="outline-container-orgheadline1" class="outline-2">
<h2 id="orgheadline1">目标 &#x2013; 一个黄色的三角形</h2>
<div class="outline-text-2" id="text-orgheadline1">
<p>
大家肯定尝试过很多的编程语言, 刚接触到一门新的编程语言, 写上一个 Hello World 是必然的. 在学习 OpenGL 时, 那么第一件事就应该是画一个三角形. 三角形就是 OpenGL 的 Hello
World 了.
</p>

<p>
现代的 OpenGL 做复杂的事情, 特别简单, 而做一件简单的事情, 却看起来特别复杂, 比如, 
我们接下来画三角形的这个例子, 是有点复杂的. 我猜想或许有很多有志青年也要学习现代
OpenGL, 还没有上阵就败在了三角形上. 别问我是怎么知道的, 我才不能告诉你我因为一个三角形退缩的次数捏!
</p>

<p>
<!-- more -->
</p>
</div>
</div>

<div id="outline-container-orgheadline2" class="outline-2">
<h2 id="orgheadline2">屏幕坐标系和右手定则</h2>
<div class="outline-text-2" id="text-orgheadline2">
<p>
本系列教程立足于实践, 但 OpenGL 是一门理论和实践并重的学问. 如果不在这里提及一些
OpenGL 的理论, 会感觉没有讲清楚.
</p>
</div>
</div>
